Revit 2027 API
ElectricalConnectedPhases Enumeration
 The electrical connected phases of an electrical analytical node.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ElectricalConnectedPhases
Public Enumeration ElectricalConnectedPhases
public enum class ElectricalConnectedPhases
type ElectricalConnectedPhases
Members
Member name | Value | Description
AB | 3 |  Phase AB
ABC | 9 |  Phase ABC
ABCN | 10 |  Phase ABCN
ABN | 6 |  Phase ABN
AN | 0 |  Phase AN
BC | 4 |  Phase BC
BCN | 7 |  Phase BCN
BN | 1 |  Phase BN
CA | 5 |  Phase CA
CAN | 8 |  Phase CAN
CN | 2 |  Phase CN
Invalid | -1 |  The invalid state, no text field. It does not shown on UI and API.
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace